<!DOCTYPE html>
<html lang="pt-BR">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Sobre</title> <!-- Altere o título conforme o arquivo: Serviços, Contato, etc. -->
  <link rel="stylesheet" href="styles.css">
</head>
<body>
  <div class="container">
    <aside class="sidebar">
      <h2>Painel de Navegação</h2>
      <nav>
        <ul>
          <li><a href="index.HTML">Início</a></li>
          <li><a href="sobre.HTML">Sobre</a></li>
          <li><a href="criadores.HTML">Serviços</a></li>
          <li><a href="teste.HTML" style="background: #555;">Interativo</a></li>
          <li><a href="tabela.HTML">Tabela</a></li>
          <li><a href="contato.Html">Contato</a></li>
        </ul>
      </nav>
    </aside>
    <main class="content">
    </blockquote>
          <h1 style="text-align: center;" data-pm-slice="1 1 []"><span style="color: #0000ff;">Desenvolvimento de um Site</span></h1>
            <h3 data-pm-slice="1 1 []">O Projeto Integrador desenvolvido neste curso consiste na cria&ccedil;&atilde;o de um site composto por cinco p&aacute;ginas, utilizando as tecnologias HTML, CSS e JavaScript. O objetivo principal &eacute; permitir que os alunos explorem os fundamentos do desenvolvimento web, praticando a estrutura&ccedil;&atilde;o de p&aacute;ginas, a estiliza&ccedil;&atilde;o e a interatividade por meio de scripts.</h3>
             <h3>O site ser&aacute; constru&iacute;do de maneira responsiva, garantindo uma boa experi&ecirc;ncia para os usu&aacute;rios em diferentes dispositivos. Cada p&aacute;gina ter&aacute; uma fun&ccedil;&atilde;o espec&iacute;fica, abordando diferentes aspectos da web moderna. Uma das p&aacute;ginas do projeto ter&aacute; como foco a explica&ccedil;&atilde;o sobre conceitos fundamentais para os desenvolvedores, como Servidor FTP, JavaScript e Docker, ajudando a consolidar o conhecimento sobre essas tecnologias essenciais no ambiente de desenvolvimento de software.</h3>
           <h3>Al&eacute;m da implementa&ccedil;&atilde;o t&eacute;cnica, o projeto exige planejamento e organiza&ccedil;&atilde;o, desde a defini&ccedil;&atilde;o do layout at&eacute; a escolha das funcionalidades e ferramentas utilizadas. A documenta&ccedil;&atilde;o do processo ser&aacute; fundamental para demonstrar a evolu&ccedil;&atilde;o do projeto, as decis&otilde;es tomadas e os desafios enfrentados durante o desenvolvimento.</h3>
         </main>
      </div>
    <!-- Rodapé -->
  <footer>
    <p>&copy;Unifio</p>
  </footer>
</body>

